kodilla-soap/src/main/java/sample/newcourse-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:kodilla="http://kodilla.com/courses/soap">
    <soapenv:Header/>
    <soapenv:Body>
        <kodilla:getCourseRequest>
            <kodilla:name>IntelliJ</kodilla:name>
        </kodilla:getCourseRequest>
    </soapenv:Body>
</soapenv:Envelope>
